---
kind: property
id: P:Autodesk.Revit.DB.RoofType.ThermalProperties
source: html/ab697fdb-c00a-5193-5fd2-a74361363b5f.htm
---
# Autodesk.Revit.DB.RoofType.ThermalProperties Property

The calculated and settable thermal properties of the RoofType

## Syntax (C#)
```csharp
public ThermalProperties ThermalProperties { get; }
```

## Remarks
Returns Nothing nullptr a null reference ( Nothing in Visual Basic) if the roof has no thermal properties.
 Curtain roofs do not store thermal properties.